# GetSegments Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..GetSegments Method
FillGrid Class See Also
---
Gets the segments of the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<double> GetSegments()
```

Visual Basic
---
```text
Public Function GetSegments As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetSegments()
```

# ### Return Value
The segments.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace